MissingMIT/lecture-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lecture 2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Mao" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Lecture 2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge8821a9">Scripting</a>
<ul>
<li><a href="#org0dae2a9">Defining Variables</a></li>
<li><a href="#org63ce3af">Functions</a></li>
<li><a href="#org2db4187">Error Codes and Outputs</a></li>
<li><a href="#org24206fe">Substitutions</a></li>
</ul>
</li>
<li><a href="#org59b5b49">Tools</a></li>
<li><a href="#orgd99a6d9">Search</a></li>
<li><a href="#orgfa278c7">Navigation</a></li>
<li><a href="#org12533ca">Exercises</a></li>
</ul>
</div>
</div>
<p>
Created on 2020-07-13/02:21
</p>

<div id="outline-container-orge8821a9" class="outline-2">
<h2 id="orge8821a9">Scripting</h2>
<div class="outline-text-2" id="text-orge8821a9">
</div>
<div id="outline-container-org0dae2a9" class="outline-3">
<h3 id="org0dae2a9">Defining Variables</h3>
<div class="outline-text-3" id="text-org0dae2a9">
<ul class="org-ul">
<li><p>
To define a variable, you can use <code>foo=bar</code>.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #FCFCFA;">foo</span>=bar
<span style="color: #78DCE8;">echo</span> $<span style="color: #FCFCFA;">foo</span>
</pre>
</div>

<pre class="example">
RESULTS:
bar
</pre></li>

<li><p>
<code>foo = bar</code> would not work as it is the equivalent as <code>foo</code> calling upon the <code>=</code>, and <code>bar</code> arguments.
</p>

<ul class="org-ul">
<li>Strings can be desginated using <code>'</code> and <code>"</code>.
<ul class="org-ul">
<li><code>'</code> is used for literal strings and will not subsitute variables.</li>
<li><code>"</code> will be able to subsitute variables.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">    <span style="color: #FCFCFA;">foo</span>=bar
    <span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"</span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">foo</span><span style="color: #FFD866;">"</span>
    <span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">'$foo'</span>
</pre>
</div>

<pre class="example">
RESULTS:
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">bar</td>
</tr>

<tr>
<td class="org-left">$foo</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
<div id="outline-container-org63ce3af" class="outline-3">
<h3 id="org63ce3af">Functions</h3>
<div class="outline-text-3" id="text-org63ce3af">
<ul class="org-ul">
<li>Bash supports control flow techniques such as <code>if</code>, <code>case</code>, and <code>for</code>.</li>
<li><p>
Bash also has functions which take arguments and operate them.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #A9DC76;">mcd</span> <span style="color: #AB9DF2;">()</span> <span style="color: #AB9DF2;">{</span>
    <span style="color: #78DCE8;">mkdir</span> -p <span style="color: #FFD866;">"</span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">1</span><span style="color: #FFD866;">"</span>
<span style="color: #78DCE8;">cd</span> <span style="color: #FFD866;">"</span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">1</span><span style="color: #FFD866;">"</span>
<span style="color: #AB9DF2;">}</span>
</pre>
</div></li>

<li>In this scenario, <code>$1</code> is the first argument to the function.
<ul class="org-ul">
<li>This function will make a directory with the name of the argument <code>$1</code> and <code>cd</code> into that folder.</li>
</ul></li>
</ul>


<ul class="org-ul">
<li><p>
In bash, there are a number of relevant variables.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">$0</td>
<td class="org-left">Name of script</td>
</tr>

<tr>
<td class="org-left">$1 to $9</td>
<td class="org-left">Arguments to the script</td>
</tr>

<tr>
<td class="org-left">$@</td>
<td class="org-left">All the arguments</td>
</tr>

<tr>
<td class="org-left">$#</td>
<td class="org-left">Number of arguments</td>
</tr>

<tr>
<td class="org-left">$?</td>
<td class="org-left">Return code of the previous command</td>
</tr>

<tr>
<td class="org-left">$$</td>
<td class="org-left">Process identification number (PID) of the current script</td>
</tr>

<tr>
<td class="org-left">!!</td>
<td class="org-left">Entire last command, including arguments.</td>
</tr>

<tr>
<td class="org-left">$_</td>
<td class="org-left">Last argument from previous command.</td>
</tr>
</tbody>
</table></li>

<li>A full list can be found <a href="https://www.tldp.org/LDP/abs/html/special-chars.html">here.</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2db4187" class="outline-3">
<h3 id="org2db4187">Error Codes and Outputs</h3>
<div class="outline-text-3" id="text-org2db4187">
<ul class="org-ul">
<li>A return code of <code>0</code> means that the previous function ran <b>without</b> any issues.</li>
<li>Return code of <code>1</code> means there <b>was</b> an issue.</li>
</ul>


<ul class="org-ul">
<li><i>True</i> will return error code <code>0</code>.</li>
<li><i>False</i> will return error code <code>1</code>.</li>
</ul>


<ul class="org-ul">
<li>This way, error codes can be used conditionally to execute commands.</li>
</ul>


<ul class="org-ul">
<li><code>||</code> is equivalent to <code>or</code>. If error code returns one, it will run the second command.
<ul class="org-ul">
<li><p>
The second command will not run if the first command did not return an error code.
</p>
<div class="org-src-container">
<pre class="src src-shell">    <span style="color: #78DCE8;">false</span> || <span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"Oops fail"</span>
    <span style="color: #78DCE8;">true</span> || <span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"This prints nothing"</span>
</pre>
</div>
<pre class="example">
RESULTS:
Oops fail
</pre></li>
</ul></li>

<li><p>
Similarly <code>&amp;&amp;</code> symbolizes <code>and</code>. If the first command runs successfully, the second will too.
</p>
<ul class="org-ul">
<li>If the first command returns an error code, the second will not run.</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #78DCE8;">true</span> &amp;&amp; <span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"Prints"</span>
</pre>
</div>

<pre class="example">
RESULTS:
Prints
</pre>


<div class="org-src-container">
<pre class="src src-shell"><span style="color: #78DCE8;">false</span> &amp;&amp; <span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"Doesn't print"</span>
</pre>
</div>

<pre class="example">
RESULTS:
</pre></li>
</ul>
<ul class="org-ul">
<li>The usage of <code>;</code> will always run the next command.</li>

<li><p>
The output of a command can be stored within a variable using:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #FCFCFA;">foo</span>=$<span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">pwd</span><span style="color: #AB9DF2;">)</span>
<span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"We are in </span><span style="color: #FF6188; font-weight: bold;">$(</span><span style="color: #FF6188; font-weight: bold;">pwd</span><span style="color: #FF6188; font-weight: bold;">)</span><span style="color: #FFD866;">"</span>
<span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"We are in </span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">foo</span><span style="color: #FFD866;">"</span>
</pre>
</div>

<pre class="example">
RESULTS:
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">We</td>
<td class="org-left">are</td>
<td class="org-left">in</td>
<td class="org-left">/Users/johnmao/johnrmao.github.io/org/MissingMIT</td>
</tr>

<tr>
<td class="org-left">We</td>
<td class="org-left">are</td>
<td class="org-left">in</td>
<td class="org-left">/Users/johnmao/johnrmao.github.io/org/MissingMIT</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-org24206fe" class="outline-3">
<h3 id="org24206fe">Substitutions</h3>
<div class="outline-text-3" id="text-org24206fe">
<ul class="org-ul">
<li>To feed the output of a command as a variable, use <i>command subsitution.</i>

<ul class="org-ul">
<li><code>$( CMD )</code> will execute <code>CMD</code> and substitute <code>$( CMD )</code> with the output.</li>
</ul></li>

<li>There is similar feature known as <i>process subsitution.</i>

<ul class="org-ul">
<li><code>&lt;( CMD )</code> will execute <code>CMD</code> and place the output within a temporary file, replacing <code>&lt;()</code> with that file's name.</li>
</ul></li>

<li><p>
An example of what's mentioned above would be:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"Starting program at </span><span style="color: #FF6188; font-weight: bold;">$(</span><span style="color: #FF6188; font-weight: bold;">date</span><span style="color: #FF6188; font-weight: bold;">)</span><span style="color: #FFD866;">"</span> <span style="color: #727072;"># </span><span style="color: #727072;">The current </span><span style="color: #727072;">date</span><span style="color: #727072;"> will replace $(</span><span style="color: #727072;">date</span><span style="color: #727072;">) in this scenario</span>
<span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"Running program </span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">0</span><span style="color: #FFD866;"> with </span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">#</span><span style="color: #FFD866;"> arguments with pid $$"</span>

<span style="color: #FF6188;">for</span> file<span style="color: #FF6188;"> in</span> <span style="color: #FFD866;">"</span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">@</span><span style="color: #FFD866;">"</span>; <span style="color: #FF6188;">do</span> <span style="color: #727072;"># </span><span style="color: #727072;">-ne is comparing to see if $@ does not equal 0</span>
    <span style="color: #78DCE8;">grep</span> foobar <span style="color: #FFD866;">"</span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">file</span><span style="color: #FFD866;">"</span> &gt; /dev/null <span style="color: #AB9DF2; font-weight: bold;">2</span>&gt; /dev/null
    <span style="color: #727072;"># </span><span style="color: #727072;">if nothing is found, </span><span style="color: #727072;">grep</span><span style="color: #727072;"> returns exit status 1</span>
    <span style="color: #727072;"># </span><span style="color: #727072;">redirected STDOUT and STDERR to null register as they are irrelevant</span>
    <span style="color: #FF6188;">if</span> <span style="color: #AB9DF2;">[</span><span style="color: #78DCE8;">[</span> $<span style="color: #FCFCFA;">?</span> -ne <span style="color: #AB9DF2; font-weight: bold;">0</span> <span style="color: #78DCE8;">]</span><span style="color: #AB9DF2;">]</span>; <span style="color: #FF6188;">then</span>
        <span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"File </span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">file</span><span style="color: #FFD866;"> does not have any foobar, adding one"</span>
        <span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"# foobar"</span> &gt;&gt; <span style="color: #FFD866;">"</span><span style="color: #AB9DF2;">$</span><span style="color: #FCFCFA;">file</span><span style="color: #FFD866;">"</span>
    <span style="color: #FF6188;">fi</span>
<span style="color: #FF6188;">done</span>
</pre>
</div></li>
<li>Here, using <code>-ne</code> we can test whether <code>$?</code> was not equal to 0.</li>
<li>The script above will take arguments and <code>grep</code> them for "foobar" and will add a "foobar" if it was not detected.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org59b5b49" class="outline-2">
<h2 id="org59b5b49">Tools</h2>
</div>

<div id="outline-container-orgd99a6d9" class="outline-2">
<h2 id="orgd99a6d9">Search</h2>
</div>

<div id="outline-container-orgfa278c7" class="outline-2">
<h2 id="orgfa278c7">Navigation</h2>
</div>
<div id="outline-container-org12533ca" class="outline-2">
<h2 id="org12533ca">Exercises</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Mao</p>
</div>
</body>
</html>
